Repository: madrisan/autospec
Catalog: po/*/autospec.po
Languages: it

source: cannot get the package name, use the \`-n' option
it: impossibile ricavare il nome del pacchetto, usa l'opzione \`-n'

source: invalid version number
it: numero di versione non valido

source: cannot get the package version, use the \`-v' option
it: impossibile ricavare la versione del pacchetto, usa l'opzione \`-v'

source: can't create output file
it: impossibile creare il file di output

source: generating specfile
it: generazione dello specfile

source: source
it: sorgente

source: mode
it: modo

source: libraries must have this name structure (use \`-n'):
it: i nomi delle librerie devono avere questa struttura (usare \`-n'):

source: perl modules must have this name structure (use \`-n'):
it: i nomi dei moduli perl devono avere questa struttura (usare \`-n'):

source: python modules must have this name structure (use \`-n'):
it: i nomi dei moduli python devono avere questa struttura (usare \`-n'):

source: unsupported package compression method
it: metodo di compressione del pacchetto non supportato

source: looks like a perl package (use \`-t perl' if this is true)
it: sembra un pacchetto perl (in questo caso usa \`-t perl')

source: looks like a python module (use \`-t python' if this is true)
it: sembra un modulo python (in questo caso usa \`-t python')

source: created specfile
it: creato specfile

source: does not point to a valid internet address
it: non fa riferimento ad un indirizzo internet

source: not a standard structure (see config file)
it: nome con struttura non standard (vedi configurazione)

source: found \`-D' and/or \`-T' option(s) in the \`%setup' directive
it: sospetta opzione \`-D' e/o \`-T' nella direttiva \`%setup'

source: missing at least one \`%defattr' directive
it: manca almeno una direttiva \`%defattr'

source: use rpm macros if possible:
it: utilizzare le macro rpm quando possibile:

source: localization files must be packaged via \`%find_lang'
it: trovati file di localizzazione non gestiti da \`%find_lang'

source: info pages
it: pagine info

source: info pages are not installed/uninstalled in the correct way
it: le pagine info non vengono installate/disinstallate correttamente

source: package Groups
it: campi Group dei pacchetti

source: invalid \`Group'
it: \`Group' non valido

source: see configuration files
it: guarda nei file di configurazione

source: or enter the command
it: oppure esegui il comando

source: approved License
it: Licenza valida

source: not approved \`License'
it: \`License' non approvata

source: ${NOTE}Specfile checks: ${NORM}${WARN}$total_issues${NORM} ${NOTE}warnings.${NORM}
it: ${NOTE}Controllo dello specfile: problemi riscontrati: ${NORM}${WARN}$total_issues${NORM}

source: performing quality checks
it: esecuzione dei test di qualità

source: checking for wrong symbolic links
it: ricerca di link simbolici errati

source: wrong symlink
it: link simbolico incorretto

source: checking for \`$SPEC_BUILDROOT' (%buildroot) strings
it: ricerca della stringa \`$SPEC_BUILDROOT' (%buildroot)

source: checking for %buildroot strings
it: ricerca delle stringhe %buildroot

source: mime type:
it: tipo mime:

source: checking for \`$BUILDDIR' (%_builddir) strings
it: ricerca della stringa \`$BUILDDIR' (%_builddir)

source: checking for suspicious plugins in devel packages
it: controllo di plugin sospetti nei pacchetti devel

source: found suspect plugin \`${NOTE}$f${NORM}'
it: trovato sospetto plugin \`${NOTE}$f${NORM}'

source: checking for wrong file attributes in bin and lib directories
it: ricerca di file binari e librerie con permessi errati

source: found suspect file
it: file sospetto

source: checking for libraries with undefined symbols after relocation
it: ricerca di librerie con simboli indefiniti dopo rilocazione

source: checking for binary files installed in /etc (see FHS)
it: ricerca di file binari installati in /etc (vedi FHS)

source: checking if the info catalog is updated when necessary
it: controllo se il registro delle pagine info viene aggiornato

source: info pages should be installed/uninstalled
it: le pagine info dovrebbero essere installate/disinstallate

source: checking packages for wrong user and/or group ownerships
it: ricerca di pacchetti contenenti file con errato utente e/o gruppo

source: checking packages for desktop files installed in the applnk dir
it: ricerca di pacchetti con file desktop installati in applnk

source: create desktop files for:
it: creare file desktop per:

source: see:
it: vedere:

source: checking for packages with bad BuildArch tag
it: ricerca di pacchetti con errato tag BuildArch

source: this package should be tagged \`noarch'
it: questo pacchetto dovrebbe essere di tipo \`noarch'

source: ${NOTE}Quality checks: ${#rpmpkg_name[@]} package(s) checked: ${NORM}${WARN}$total_issues${NORM}${NOTE} warning(s).${NORM}
it: ${NOTE}Controlli di qualità: pacchetti rpm: ${#rpmpkg_name[@]}; problemi riscontrati: ${NORM}${WARN}$total_issues${NORM}

source: performing security checks
it: esecuzione dei test di sicurezza

source: checking for RPATH vulnerabilities
it: ricerca di vulnerabilità di tipo RPATH

source: checking for setuid binaries
it: ricerca di binari setuid

source: checking for setgid directories
it: ricerca di directory setgid

source: checking for unsecure use of \`\$\$' in shell and perl scripts
it: ricerca di script shell e perl che utilizzano \`\$\$' in modo insicuro

source: seems to be affected
it: sembra affetto

source: Hint for bash scripts (\`mktemp' required)
it: Suggerimento per script bash (richiede \`mktemp')

source: Hint for perl scripts
it: Suggerimento per script perl

source: ${NOTE}Security checks: ${#rpmpkg_name[@]} package(s) checked: ${NORM}${WARN}$total_issues${NORM}${NOTE} warning(s).${NORM}
it: ${NOTE}Controlli di sicurezza: pacchetti rpm: ${#rpmpkg_name[@]}; problemi riscontrati: ${NORM}${WARN}$total_issues${NORM}
