Repository: madrisan/autospec
Catalog: po/*/autospec.po
Languages: it

source: this script requires bash version 2 or better
it: questo script richiede bash versione 2 o superiore

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License version 2 as published by the Free Software Foundation. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
it: Questo è software libero; è possibile redistribuirlo e/o modificarlo nei termini della GNU General Public License versione 2 così come pubblicata dalla Free Software Foundation. Non è fornita ALCUNA garanzia; neppure di NEGOZIABILITA' o di APPLICABILITA' PER UN PARTICOLARE SCOPO.

source: Automatically update rpm packages and help creating new specfiles.
it: Aggiorna automaticamente pacchetti rpm ed assiste nella creazione di specfile.

source: Operation modes
it: Modalità operative

source: Update the given package to a specified version and release
it: Aggiorna il pacchetto indicato ad una specifica versione e release

source: Try to create a specfile for the specified tarball
it: Cerca di creare uno specfile per il tarball indicato

source: Extract a given file or list of files from a srpm archive
it: Estrae da un archivio srpm un file o una lista di file indicati

source: Print the value of the given configuration variable
it: Stampa il valore che la variabile indicata ha nei file di configurazione

source: Print this help, then exit
it: Stampa questa schermata di aiuto e termina il programma

source: Print version number, then exit
it: Stampa il numero di versione e termina il programma

source: Run in quiet mode
it: Non stampa alcun dettaglio delle operazioni in esecuzione

source: Run in debugging mode (very verbose output)
it: Attiva la modalità di debugging (output prolisso)

source: Common options
it: Opzioni comuni

source: Select the theme to be used for the colorized output
it: Seleziona il tema da usare per generare l'output colorato

source: Use an alternate user configuration file
it: Definisce uno o più file di configurazione utente alternativi

source: Usage
it: Utilizzo

source: Use '-u -h', '-s -h', '-x -h', and '--eval -h' to display specific command line options.
it: Usa '-u -h', '-s -h', '-x -h', '--eval -h' per avere le opzioni a linea di comando specifiche.

source: Report bugs to <davide.madrisan@gmail.com>.
it: Segnalare eventuali bug a <davide.madrisan@gmail.com>.

source: library not found
it: libreria non trovata

source: deprecated option
it: opzione deprecata

source: use \`--colors' instead
it: utilizzare \`--colors'

source: version
it: versione

source: unset in the configuration files
it: non configurato nei file di configurazione

source: plugin not found
it: plugin non trovato

source: can't create temporary files
it: impossibile creare file temporanei

source: this script requires bash version 3 or better
it: questo script richiede bash versione 3 o superiore

source: Print the value of a given configuration variable
it: Stampa il valore che una data variabile assume nei file di configurazione

source: where the above options mean
it: dove le precedenti opzioni significano

source: Print the value of the configuration variable <var>
it: Stampa il valore che <var> assume nei file di configurazione

source: Default files:
it: File di default:

source: Default user files:
it: File di default utente:

source: Samples
it: Alcuni esempi

source: cannot read
it: impossibile leggere

source: unrecognized option
it: opzione non conosciuta

source: configuration file not found
it: file di configurazione non trovato

source: unknown variable type
it: tipo di variabile sconosciuto

source: Find for updates scanning the web.
it: Ricerca aggiornamenti cercando nel web.

source: Name of the package
it: Nome del pacchetto

source: Name of the spec file
it: Nome dello specfile

source: URL of the project home page
it: Indirizzo internet dell'homepage del progetto

source: URL with no variable expansion
it: Indirizzo internet senza espansione delle variabili

source: Proxy user
it: Utenza proxy

source: Report bugs to <stefano.cotta@openmamba.org>.
it: Segnalare eventuali bug a <stefano.cotta@openmamba.org>.

source: \`getopt' error
it: errore in \`getopt'

source: \`getopt' error: bad command \`$1'
it: errore in \`getopt': comando errato \`$1'

source: looking at
it: cerco in

source: couldn't resolve host
it: impossibile risolvere il nome dell'host

source: failed to connect to host
it: impossibile connettersi all'host

source: curl error (exit code: $retval)
it: errore curl (codice di errore: $retval)

source: not parametric source0 name; cannot update
it: source0 in formato non parametrico: impossibile aggiornare

source: found version:
it: versione trovata:

source: assertion failed:
it: asserzione fallita:

source: last version of \`${NOTE}$specname${NORM}' found:
it: ultima versione di \`${NOTE}$specname${NORM}' trovata:

source: package \`${NOTE}$specname${NORM}' is already the latest version
it: il pacchetto \`${NOTE}$specname${NORM}' è già aggiornato all'ultima versione

source: a new version of \`${NOTE}$specname${NORM}' is available!
it: è disponibile una nuova versione di \`${NOTE}$specname${NORM}'!

source: a newer version of \`${NOTE}$specname${NORM}' is already installed
it: è già installata una versione successiva di \`${NOTE}$specname${NORM}'

source: cannot find a new version of \`$specname'
it: impossibile trovare una nuova versione per \`$specname'

source: Hint
it: Suggerimento

source: user \`$(id -nu)' does not belong to group \`$packager_group'
it: l'utente \`$(id -nu)' non appartiene al gruppo \`$packager_group'

source: missing variable in the configuration file
it: variabile non inizializzata nel file di configurazione

source: loading
it: caricamento di

source: no message
it: nessun messaggio

source: WARNING
it: ATTENZIONE

source: ERROR
it: ERRORE

source: unknown color theme \`$color_scheme': colors will be disabled
it: tema di colori sconosciuto \`$color_scheme': output con colori disabilitato

source: utility not found
it: programma non trovato

source: missing mandatory arg
it: parametro mancante

source: usage error (--ftp/--html)
it: errato utilizzo (--ftp/--html)

source: '\\' characters detected in \$pck_name
it: trovato carattere '\\' in \$pck_name

source: not a number
it: non è un numero

source: getting list of files from
it: ricavo l'elenco dei file da

source: unsupported query type for this protocol
it: ricerca non supportata in questo protocollo

source: failure in receiving network data
it: impossibile recevere dati via rete

source: cannot get the list of files
it: impossibile ottenere la lista dei file

source: no list of architectures set
it: nessuna lista di architetture specificata

source: unsupported protocol
it: protocollo non supportato

source: file not found
it: file non trovato

source: skipped
it: ignorato

source: downloading
it: download di

source: no such directory
it: cartella non trovata

source: cannot download
it: impossibile scaricare

source: package not found
it: pacchetto non trovato

source: unknown action
it: azione sconosciuta

source: not the expected package version
it: non è la versione di pacchetto prevista

source: cloning git repository
it: clonazione del repository

source: cannot clone git repository
it: impossibile clonare il repository git

source: creating the compressed source tarball
it: creazione del file sorgente compresso

source: done
it: fatto

source: an error occurred while creating
it: si è verificato un errore durante la creazione di

source: detected a specfile with unsupported syntax:
it: lo specfile usa una sintassi non supportata:

source: specfile not found
it: specfile non trovato

source: FIXME: sorry, not implemented yet...
it: FIXME: spiacente, implementazione mancante...

source: \`%end' found; should perhaps be \`%endif'
it: \`%end' utilizzata; forse si intendeva \`%endif'

source: cannot evaluate:
it: impossibile valutare:

source: Get informations from a given specfile.
it: Ricava informazioni da un specfile dato.

source: name (and patch) of the specfile
it: nome (e percorso) dello specfile

source: do not try to expand variables
it: non cercare di espandere le variabili

source: and <query> belongs to the following list
it: e <query> appartiene alla lista seguente

source: list of package groups
it: lista dei gruppi utilizzati

source: full name of the srpm package
it: nome completo del pacchetto srpm

source: list of patches
it: lista delle patch

source: name of the source0 file
it: name del file indicato da source0

source: list of source files
it: lista dei source file

source: list of all the generated rpm packages
it: lista dei pacchetti rpm generati

source: list of the obsoleted packages
it: lista dei pacchetti resi obsoleti

source: list of the declared build requirements
it: lista dei \`build requirements' dichiarati

source: bad specfile preamble
it: preambolo dello specfile non conforme

source: bad arg \`$var'
it: argomento errato \`$var'

source: cannot initialize \`$var' from specfile data
it: impossibile assegnare un valore a \`$var' usando i dati dello specfile

source: no such file or directory
it: file o cartella non trovata

source: can't create temporary directory
it: impossibile creare la cartella temporanea

source: cannot extract files from rpm archive
it: impossibile estrarre i file dall'archivio rpm

source: cannot extract files from cpio archive
it: impossibile estrarre i file dall'archivio cpio

source: Extract from the srpm package <srpm_pck>...
it: Estrae dal pacchetto srpm <srpm_pck>...

source: ...the specified file or list of files <file(s)>
it: ...il file o la lista di file <file(s)>

source: Save extracted files in the directory <dir>
it: Salva i file estratti nella cartella <dir>

source: cannot find:
it: impossibile trovare:

source: not a srpm package
it: non è un pacchetto srpm

source: cannot create \`$destdir'
it: impossibile creare \`$destdir'

source: can't save extracted files to \`$destdir'
it: impossibile salvare i file estratti in \`$destdir'

source: can't decompress the file
it: impossibile decomprimere il file

source: can't save files to \`$destdir'
it: impossibile salvare i file in \`$destdir'

source: you're running $me as root
it: stai eseguendo $me come root

source: Update the package <pck> to version <ver> and release <rel>
it: Aggiorna il pacchetto <pck> a versione <ver> e release <rel>

source: Do the actions specified in the comma separated list <lst>
it: Esegue la lista di azioni separate da virgole <lst>

source: check for available versions in the $DISTRO repositories
it: cerca se il pacchetto è disponibile nei repository $DISTRO

source: download and install the srpm package
it: download ed installazione del pacchetto srpm

source: check if a new version is available
it: controlla se è disponibile un aggiornamento

source: download new source files
it: download dei nuovi file sorgente

source: update and check the specfile
it: aggiornamento e controllo dello specfile

source: build the rpm(s) and srpm packages
it: creazione dei pacchetti rpm e srpm

source: build the list of the build requirements
it: creazione della lista dei build requirement

source: simulate the installation of the rpm package(s)
it: simulazione dell'installazione dei pacchetti rpm

source: perform some quality and security checks
it: esecuzione dei test di qualità e sicurezza

source: calculate the md5/sha1 hashing values
it: calcolo dei valori di hashing md5 e sha1

source: upload the new packages to the ftp repository
it: upload dei nuovi pacchetti sul sito ftp

source: *remove* old packages from the ftp repository
it: *rimozione* dei vecchi pacchetti dal sito ftp

source: (move packages to \`\$ftp_rw_old_dir', if set)
it: (backup in \`\$ftp_rw_old_dir', se definita)

source: install the new rpm packages
it: installazione dei nuovi pacchetti rpm

source: Force the update of the rpm(s) and srpm packages
it: Forza l'aggiornamento dei pacchetti rpm e srpm

source: Force the rebuild of the rpm(s) and srpm packages
it: Ricrea comunque i pacchetti rpm e srpm

source: Install the new packages even if rpm complains for errors
it: Installa i nuovi pacchetti anche in caso di errori rpm

source: Download the source files even if found in SOURCE
it: Scarica i file sorgente anche se presenti in SOURCE

source: Try to execute the given action(s) bypassing errors
it: Cerca di eseguire comunque le azioni specificate

source: Skip the given test number(s)
it: Non esegue i test indicati

source: Define variables <v1>,<v2>,... with values <r1>,<r2>,...
it: Assegna alle variabili v1,v2,... i valori r1,r2,...

source: Select a server from where to download srpm packages
it: Server da utilizzare nel download dei pacchetti

source: Select a server where to upload packages
it: Server dove effettuare l'upload dei pacchetti

source: Select a server to be used for both download and upload
it: Server per l'upload e il download dei pacchetti

source: FTP user (usr) and password (pswd) for packages upload
it: User (usr) e password (pswd) per l'upload sul sito FTP

source: Name of the specfile (default: <name>.spec)
it: Nome dello specfile (default: <name>.spec)

source: Force the architecture to a given value
it: Forza un valore per l'architettura

source: Set change information for the package
it: Scrive il messaggio indicato nel changelog del pacchetto

source: action
it: azione

source: Only build the rpm packages
it: Crea soltanto i pacchetti rpm

source: Do not upload the srpm package
it: Non effettua l'upload del pacchetto srpm

source: Only build the srpm package
it: Crea soltanto il pacchetto srpm

source: Do not upload the rpm packages
it: Non effettua l'upload dei pacchetti rpm

source: Do a \`list check'
it: Cerca i file non pacchettizzati

source: Replace the block AUTOBUILDREQ
it: Aggiorna il blocco AUTOBUILDREQ

source: Remove all the temporary files except (s)rpm packages
it: Rimuove tutti i file temporanei

source: Enable specfile autoformatting
it: Abilita la riformattazione dello specfile

source: Unable logging to file (logging dir: \`\$logging_dir')
it: Abilita il log su file (nella directory: \`\$logging_dir'

source: Enable rebuilding mode and settings (action 4 only)
it: Attiva modalità ed impostazioni di rebuild (azione 4)

source: Specify an alternative root directory to rpm
it: Definisce una root directory alternativa per rpm

source: changelog entry
it: stringa di changelog

source: must be set in the configuration file
it: non inizializzato nei file di configurazione

source: must have the same size
it: devono avere la stessa dimensione

source: illegal value
it: valore non valido

source: assuming as specfile
it: assumo che lo specfile sia

source: unsupported path for specfile
it: persorso dello specfile non supportato

source: specfile with CRLF line terminators
it: specfile con fine linea CRLF

source: specfile with CR line terminators
it: specfile con fine linea CR

source: specfile with an unsupported format
it: specfile in formato non supportato

source: specfile has errors:
it: lo specfile contiene degli errori:

source: the error should be here!
it: l'errore dovrebbe essere qui!

source: release number: unsupported format
it: numero di release: formato non supportato

source: new release \`$pck_newrel' must be greater than current one \`$SPEC_RELEASE'
it: la nuova release \`$pck_newrel' deve essere maggiore di quella corrente \`$SPEC_RELEASE'

source: making a ${NOTE}backup copy${NORM} of the current specfile
it: creazione di una ${NOTE}copia di backup${NORM} dello specfile corrente

source: unsupported architecture
it: architettura non supportata

source: missing package name
it: nome del pacchetto mancante

source: cannot create logging directory
it: impossibile creare la directory di logging

source: logging file
it: file di log

source: no action specified: set with \`--action'
it: nessuna azione specificata: utilizzare \`--action'

source: sintax error in --action \`$4'
it: errore di instassi in --action \`$4'

source: sintax error in the command
it: errore di sintassi nel comando

source: illegal value for arg
it: valore non valido per l'argomento

source: updating package ${NOTE}${pck_name##*/}${NORM} to version ${NOTE}${pck_newver}${NORM}
it: aggiornamento del pacchetto ${NOTE}${pck_name##*/}${NORM} alla versione ${NOTE}${pck_newver}${NORM}

source: updating package
it: aggiornamento del pacchetto

source: multiple package update (regexp: ${NOTE}$pck_name${NORM}) to version ${NOTE}${pck_newver}${NORM}
it: aggiornamento multiplo di pacchetti (${NOTE}$pck_name${NORM}) alla versione ${NOTE}${pck_newver}${NORM}

source: multiple package update (regexp: ${NOTE}$pck_name${NORM})
it: aggiornamento multiplo di pacchetti (${NOTE}$pck_name${NORM})

source: several occurrences found
it: trovati diversi pacchetti candidati

source: Repository
it: Archivio

source: Package
it: Pacchetto

source: cannot find a matching SRPM package in the given repositories
it: impossibile trovare il pacchetto SRPM nei repository indicati

source: too many packages found
it: trovati troppi pacchetti candidati

source: installing
it: installazione di

source: an error occurred while installing \`$got_SPEC_FILENAME'
it: si è verificato un errore installando \`$got_SPEC_FILENAME'

source: unknown retcode for apse.scrapeversion()
it: codice di ritorno sconosciuto per apse.scrapeversion()

source: version for new package required
it: versione del nuovo pacchetto non indicata

source: ${NOTE}updating${NORM} the new specfile \`${NOTE}$spec_dir/$SRPM_SPECFILE${NORM}'
it: ${NOTE}aggiornamento${NORM} del nuovo specfile \`${NOTE}$spec_dir/$SRPM_SPECFILE${NORM}'

source: specfile autoformattig enabled
it: formattazione automatica dello specfile abilitata

source: illegal \`format_extra_rules' (see configuration file(s))
it: \`format_extra_rules' non corretta (vedi file di configurazione)

source: missing entry forced
it: aggiunta voce mancante

source: missing entry in the specfile:
it: voce mancante nello specfile:

source: \`%description' has empty body
it: trovata \`%description' senza testo

source: parsing the \`%package' block
it: parsing del blocco \`%package'

source: cannot create \`$SRPM_SPECFILE_WITH_PATH'
it: impossibile creare \`$SRPM_SPECFILE_WITH_PATH'

source: build the srpm package
it: creazione del pacchetto srpm

source: the version entered at command line doesn't match the version set in the specfile
it: versione specificata a linea di comando differente da quanto indicato nello specfile

source: the release entered at command line doesn't match the version set in the specfile
it: release specificata a linea di comando differente da quanto indicato nello specfile

source: building the rpm packages
it: creazione dei pacchetti rpm

source: specfile is newer than rpm package(s) (according to modification date)
it: lo specfile è stato modificato dopo la creazione dei pacchetti rpm

source: building the srpm package
it: creazione del pacchetto srpm

source: specfile is newer than srpm (according to modification date)
it: lo specfile è più recente del file srpm

source: build requirement found
it: trovato build requirement

source: installing missing build requirement
it: installazione del "build requirement"

source: cannot install the needed build requirements
it: impossibile installare i "build requirement" necessari

source: found ${NOTE}missing BuildRequirement${NORM} \`${NOTE}$f${NORM}'
it: trovato ${NOTE}BuildRequirement non soddisfatto${NORM} \`${NOTE}$f${NORM}'

source: testing out specfile
it: esecuzione dei test sullo specfile

source: rpmbuild exited with error code
it: rpmbuild è terminato con il codice d'errore

source: checking for unpackaged files
it: ricerca di file non inseriti nei blocchi %files

source: building rpm and srpm packages
it: creazione dei pacchetti rpm e srpm

source: It seems good but do not forget to run quality and security tests
it: Sembra ok ma non dimenticare di eseguire i test di qualità e sicurezza

source: Add the following files in the right %files blocks
it: Smistare i seguenti file nelle sezioni %files corrispondenti

source: release for new package required
it: release del nuovo pacchetto non indicata

source: ignoring requirement
it: requirement ignorato

source: replacing the AUTOBUILDREQ block by:
it: sostituzione del blocco AUTOBUILDREQ con:

source: rpm exited with error code:
it: rpm è terminato con il codice di errore:

source: checking the specfile for common mistakes
it: controllo dello specfile alla ricerca di comuni errori

source: checking packages for common mistakes
it: controllo dei pacchetti alla ricerca di comuni errori

source: server unreachable
it: server non raggiungibile

source: you have no read write access to url#$ftp_server_upload_num
it: accesso in scrittura alla url#$ftp_server_upload_num vietato

source: ftp upload has been disabled
it: l'upload dei pacchetti via ftp è stato disabilitato

source: trying with the ${NOTE}anonymous login${NORM}
it: provo ad utilizzare un ${NOTE}login anonimo${NORM}

source: no old packages have been found.
it: non sono stati trovati vecchi pacchetti.

source: moving old packages to the remote backup folder
it: sposto i vecchi pacchetti nella directory di backup del repository

source: removing old packages from the repository
it: rimozione dei vecchi pacchetti dal sito

source: force enabled
it: forzata

source: cannot install the new rpm packages
it: impossibile installare i pacchetti rpm

source: unknown step \`$step'
it: lo step \`$step' non esiste

source: cleaning up temporary files
it: eliminazione dei file temporanei

source: removing source packages and patches, if any
it: rimozione dei pacchetti sorgente e delle patch, se presenti

source: removing
it: rimozione di

source: Try to create a specfile for the specified source archive
it: Cerca di creare uno specfile per l'archivio sorgente indicato

source: message
it: messaggio

source: git-opts
it: opzioni-git

source: Name of the package (default: taken from <source-archive> name)
it: Nome del pacchetto (default: ricavato dal nome dell'archivio sorgente)

source: Version of the package (default: taken from <source-archive> name)
it: Versione del pacchetto (default: ricavato dal nome dell'archivio sorgente)

source: Typology of the specfile to be created
it: Categoria dello specfile da generare

source: standard specfile (default)
it: specfile standard (default)

source: specfile for gnome packages
it: specfile per pacchetti gnome

source: specfile for kde3 packages
it: specfile per pacchetti kde3

source: specfile for kde4 packages
it: specfile per pacchetti kde4

source: specfile for common library packages
it: specfile per librerie

source: specfile for single-package perl modules
it: specfile per singoli moduli perl

source: specfile for python modules
it: specfile per moduli python

source: standard specfile for system/network services
it: specfile per servizi di sistema/rete

source: Redirect the output to the file <outfile>
it: Redirige lo standard output sul file <outfile>

source: Specify a git branch
it: Specifica un branch git

source: Do not remove git files
it: Non rimuove i file git

source: remember to modify the value for \`${NOTE}$id${NORM}'
it: ricordarsi di modificare il valore di \`${NOTE}$id${NORM}'

source: unknown build techonology
it: tecnologia di build sconosciuta

source: line
it: linea

source: too many nested @if blocks
it: troppi livelli di blocchi @if

source: @else without @if statement
it: @else senza un corrispondente @if

source: @fi without @if statement
it: @fi senza un corrispondente @if

source: missing tarball name
it: manca il nome del tarball

source: cannot find the package $pck_tarball
it: impossibile trovare il pacchetto $pck_tarball
